// 7. Напишите программу которая 
// на вход принимает трехзначное число
// и на выходе показывает последнюю цифру
// этого чмсла
// 456 - 6
// 782 - 2
// 918 - 8

Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());




